{
  "INTJ": "Congratulations, you’ve unlocked the achievement: 'Cold, Calculated, and Chronically Unimpressed.' You probably had your life planned at age 7. Too bad the rest of humanity keeps ruining it.",
  "INTP": "Endlessly analyzing life while forgetting to eat. You’re 3 existential crises ahead of everyone, yet still shocked when someone asks you to feel emotions. Your soulmate is probably a thought experiment.",
  "ENTJ": "Born to lead… or bulldoze. You micromanage group projects in hell and still think it’s 'efficient.' Empathy not found. Please install update.",
  "ENTP": "Argument is your love language. You could sell existential dread to a nihilist. Life’s a debate and you’re winning, even if no one asked for it.",
  "INFJ": "The mysterious empath who cries over dying plants and then ghostwrites your autobiography. Beautiful soul, doomed to feel everything… including the pain of being misunderstood forever.",
  "INFP": "Main character syndrome with a side of delusion. Idealistic, poetic, and perpetually heartbroken over fictional characters. Therapy? No thanks. I journal.",
  "ENFJ": "The emotional support human for every friend group. Loved by all. Trusted by many. Secretly dying inside while fixing everyone’s life but their own.",
  "ENFP": "Chaotic sunshine with ADHD tendencies. You start 12 projects, finish none, but have an inspirational quote for each. Spontaneous? Yes. Stable? Absolutely not.",
  "ISTJ": "The human equivalent of a filing cabinet. You follow rules like they’re holy scripture and treat spontaneity like a crime. Somehow always right and deeply annoyed by it.",
  "ISFJ": "Sweet, gentle, loyal—and mentally exhausted from taking care of emotional toddlers disguised as friends. Your kindness is a full-time job. Where’s the raise?",
  "ESTJ": "CEO of Everything™, even if it's just the family WhatsApp group. You wake up at 6 AM on Sundays for fun. People fear your to-do lists.",
  "ESFJ": "The neighborhood committee lives in your heart. You host brunches, remember birthdays, and suffer from a chronic fear of being disliked. People-pleasing: Level God.",
  "ISTP": "Fixes your car, breaks your heart. Mysterious, emotionally elusive, and allergic to feelings. If something’s broken, you’ll fix it—unless it’s your personal life.",
  "ISFP": "A Pinterest board with abandonment issues. You romanticize literally everything and vanish whenever responsibilities show up. At least your Instagram looks great.",
  "ESTP": "Zero attention span, 100% confidence. You do before you think, then do again. Adrenaline is your breakfast. Boundaries are for other people.",
  "ESFP": "The human disco ball. You shine bright, party harder, and cry in the club at least once a month. Deep down? Just a clown with a deep backstory."
}
